{"keras_version": "1.1.0", "class_name": "Model", "config": {"output_layers": [["convolution2d_8", 0, 0]], "name": "model_5", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_4", "config": {"batch_input_shape": [null, 2], "input_dtype": "float32", "name": "input_4", "sparse": false}}, {"inbound_nodes": [[["input_4", 0, 0]]], "class_name": "Dense", "name": "dense_10", "config": {"output_dim": 128, "W_regularizer": null, "bias": true, "input_dim": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_10", "activity_regularizer": null, "W_constraint": null, "activation": "relu", "b_constraint": null, "trainable": true}}, {"inbound_nodes": [[["dense_10", 0, 0]]], "class_name": "Dense", "name": "dense_11", "config": {"output_dim": 12544, "W_regularizer": null, "bias": true, "input_dim": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_11", "activity_regularizer": null, "W_constraint": null, "activation": "relu", "b_constraint": null, "trainable": true}}, {"inbound_nodes": [[["dense_11", 0, 0]]], "class_name": "Reshape", "name": "reshape_4", "config": {"target_shape": [14, 14, 64], "name": "reshape_4", "trainable": true}}, {"inbound_nodes": [[["reshape_4", 0, 0]]], "class_name": "Deconvolution2D", "name": "deconvolution2d_10", "config": {"W_regularizer": null, "bias": true, "border_mode": "same", "output_shape": [null, 14, 14, 64], "init": "glorot_uniform", "name": "deconvolution2d_10", "nb_col": 3, "activity_regularizer": null, "W_constraint": null, "nb_filter": 64, "nb_row": 3, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "trainable": true, "b_constraint": null}}, {"inbound_nodes": [[["deconvolution2d_10", 0, 0]]], "class_name": "Deconvolution2D", "name": "deconvolution2d_11", "config": {"W_regularizer": null, "bias": true, "border_mode": "same", "output_shape": [null, 14, 14, 64], "init": "glorot_uniform", "name": "deconvolution2d_11", "nb_col": 3, "activity_regularizer": null, "W_constraint": null, "nb_filter": 64, "nb_row": 3, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "trainable": true, "b_constraint": null}}, {"inbound_nodes": [[["deconvolution2d_11", 0, 0]]], "class_name": "Deconvolution2D", "name": "deconvolution2d_12", "config": {"W_regularizer": null, "bias": true, "border_mode": "valid", "output_shape": [null, 28, 28, 64], "init": "glorot_uniform", "name": "deconvolution2d_12", "nb_col": 2, "activity_regularizer": null, "W_constraint": null, "nb_filter": 64, "nb_row": 2, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "subsample": [2, 2], "trainable": true, "b_constraint": null}}, {"inbound_nodes": [[["deconvolution2d_12", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_8", "config": {"W_regularizer": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "name": "convolution2d_8", "nb_col": 2, "activity_regularizer": null, "W_constraint": null, "nb_filter": 1, "nb_row": 2, "activation": "sigmoid", "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "valid", "b_constraint": null}}], "input_layers": [["input_4", 0, 0]]}}