{"class_name": "Model", "config": {"name": "model_1", "output_layers": [["predictions", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 299, 299, 3], "name": "input_1", "input_dtype": "float32"}}, {"name": "convolution2d_1", "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"nb_col": 3, "nb_row": 3, "bias": true, "name": "convolution2d_1", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 32, "dim_ordering": "tf", "subsample": [2, 2], "border_mode": "valid", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_1", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "convolution2d_2", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "config": {"nb_col": 3, "nb_row": 3, "bias": true, "name": "convolution2d_2", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 32, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_2", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_2", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "convolution2d_3", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "config": {"nb_col": 3, "nb_row": 3, "bias": true, "name": "convolution2d_3", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_3", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "maxpooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_1", "trainable": true, "strides": [2, 2], "pool_size": [3, 3]}}, {"name": "convolution2d_4", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_4", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 80, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_4", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_4", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "convolution2d_5", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "config": {"nb_col": 3, "nb_row": 3, "bias": true, "name": "convolution2d_5", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 192, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_5", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_5", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "maxpooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_2", "trainable": true, "strides": [2, 2], "pool_size": [3, 3]}}, {"name": "convolution2d_9", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_9", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_9", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_9", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_9", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "convolution2d_7", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_7", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 48, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_10", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_9", 0, 0]]], "config": {"nb_col": 3, "nb_row": 3, "bias": true, "name": "convolution2d_10", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 96, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_7", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_7", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_10", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_10", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_10", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "averagepooling2d_1", "class_name": "AveragePooling2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"dim_ordering": "tf", "border_mode": "same", "name": "averagepooling2d_1", "trainable": true, "strides": [1, 1], "pool_size": [3, 3]}}, {"name": "convolution2d_6", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_6", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_8", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_7", 0, 0]]], "config": {"nb_col": 5, "nb_row": 5, "bias": true, "name": "convolution2d_8", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_11", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_10", 0, 0]]], "config": {"nb_col": 3, "nb_row": 3, "bias": true, "name": "convolution2d_11", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 96, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_12", "class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_1", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_12", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 32, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_6", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_6", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_8", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_8", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_11", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_11", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_11", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_12", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_12", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_12", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "mixed0", "class_name": "Merge", "inbound_nodes": [[["batchnormalization_6", 0, 0], ["batchnormalization_8", 0, 0], ["batchnormalization_11", 0, 0], ["batchnormalization_12", 0, 0]]], "config": {"mode_type": "raw", "mode": "concat", "output_shape_type": "raw", "dot_axes": -1, "name": "mixed0", "concat_axis": 3, "output_shape": null}}, {"name": "convolution2d_16", "class_name": "Convolution2D", "inbound_nodes": [[["mixed0", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_16", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_16", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_16", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_16", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "convolution2d_14", "class_name": "Convolution2D", "inbound_nodes": [[["mixed0", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_14", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 48, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_17", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_16", 0, 0]]], "config": {"nb_col": 3, "nb_row": 3, "bias": true, "name": "convolution2d_17", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 96, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_14", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_14", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_14", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_17", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_17", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_17", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "averagepooling2d_2", "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed0", 0, 0]]], "config": {"dim_ordering": "tf", "border_mode": "same", "name": "averagepooling2d_2", "trainable": true, "strides": [1, 1], "pool_size": [3, 3]}}, {"name": "convolution2d_13", "class_name": "Convolution2D", "inbound_nodes": [[["mixed0", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_13", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_15", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_14", 0, 0]]], "config": {"nb_col": 5, "nb_row": 5, "bias": true, "name": "convolution2d_15", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_18", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_17", 0, 0]]], "config": {"nb_col": 3, "nb_row": 3, "bias": true, "name": "convolution2d_18", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 96, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_19", "class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_2", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_19", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 32, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_13", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_13", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_13", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_15", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_15", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_15", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_18", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_18", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_18", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_19", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_19", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_19", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "mixed1", "class_name": "Merge", "inbound_nodes": [[["batchnormalization_13", 0, 0], ["batchnormalization_15", 0, 0], ["batchnormalization_18", 0, 0], ["batchnormalization_19", 0, 0]]], "config": {"mode_type": "raw", "mode": "concat", "output_shape_type": "raw", "dot_axes": -1, "name": "mixed1", "concat_axis": 3, "output_shape": null}}, {"name": "convolution2d_23", "class_name": "Convolution2D", "inbound_nodes": [[["mixed1", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_23", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_23", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_23", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_23", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "convolution2d_21", "class_name": "Convolution2D", "inbound_nodes": [[["mixed1", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_21", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 48, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_24", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_23", 0, 0]]], "config": {"nb_col": 3, "nb_row": 3, "bias": true, "name": "convolution2d_24", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 96, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_21", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_21", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_21", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_24", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_24", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_24", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "averagepooling2d_3", "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed1", 0, 0]]], "config": {"dim_ordering": "tf", "border_mode": "same", "name": "averagepooling2d_3", "trainable": true, "strides": [1, 1], "pool_size": [3, 3]}}, {"name": "convolution2d_20", "class_name": "Convolution2D", "inbound_nodes": [[["mixed1", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_20", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_22", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_21", 0, 0]]], "config": {"nb_col": 5, "nb_row": 5, "bias": true, "name": "convolution2d_22", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_25", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_24", 0, 0]]], "config": {"nb_col": 3, "nb_row": 3, "bias": true, "name": "convolution2d_25", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 96, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_26", "class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_3", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_26", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 32, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_20", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_20", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_20", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_22", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_22", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_22", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_25", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_25", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_25", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_26", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_26", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_26", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "mixed2", "class_name": "Merge", "inbound_nodes": [[["batchnormalization_20", 0, 0], ["batchnormalization_22", 0, 0], ["batchnormalization_25", 0, 0], ["batchnormalization_26", 0, 0]]], "config": {"mode_type": "raw", "mode": "concat", "output_shape_type": "raw", "dot_axes": -1, "name": "mixed2", "concat_axis": 3, "output_shape": null}}, {"name": "convolution2d_28", "class_name": "Convolution2D", "inbound_nodes": [[["mixed2", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_28", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_28", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_28", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_28", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "convolution2d_29", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_28", 0, 0]]], "config": {"nb_col": 3, "nb_row": 3, "bias": true, "name": "convolution2d_29", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 96, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_29", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_29", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_29", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "convolution2d_27", "class_name": "Convolution2D", "inbound_nodes": [[["mixed2", 0, 0]]], "config": {"nb_col": 3, "nb_row": 3, "bias": true, "name": "convolution2d_27", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 384, "dim_ordering": "tf", "subsample": [2, 2], "border_mode": "valid", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_30", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_29", 0, 0]]], "config": {"nb_col": 3, "nb_row": 3, "bias": true, "name": "convolution2d_30", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 96, "dim_ordering": "tf", "subsample": [2, 2], "border_mode": "valid", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_27", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_27", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_27", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_30", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_30", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_30", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "maxpooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["mixed2", 0, 0]]], "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_3", "trainable": true, "strides": [2, 2], "pool_size": [3, 3]}}, {"name": "mixed3", "class_name": "Merge", "inbound_nodes": [[["batchnormalization_27", 0, 0], ["batchnormalization_30", 0, 0], ["maxpooling2d_3", 0, 0]]], "config": {"mode_type": "raw", "mode": "concat", "output_shape_type": "raw", "dot_axes": -1, "name": "mixed3", "concat_axis": 3, "output_shape": null}}, {"name": "convolution2d_35", "class_name": "Convolution2D", "inbound_nodes": [[["mixed3", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_35", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 128, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_35", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_35", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_35", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "convolution2d_36", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_35", 0, 0]]], "config": {"nb_col": 1, "nb_row": 7, "bias": true, "name": "convolution2d_36", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 128, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_36", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_36", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_36", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "convolution2d_32", "class_name": "Convolution2D", "inbound_nodes": [[["mixed3", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_32", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 128, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_37", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_36", 0, 0]]], "config": {"nb_col": 7, "nb_row": 1, "bias": true, "name": "convolution2d_37", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 128, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_32", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_32", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_32", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_37", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_37", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_37", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "convolution2d_33", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_32", 0, 0]]], "config": {"nb_col": 7, "nb_row": 1, "bias": true, "name": "convolution2d_33", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 128, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_38", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_37", 0, 0]]], "config": {"nb_col": 1, "nb_row": 7, "bias": true, "name": "convolution2d_38", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 128, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_33", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_33", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_33", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_38", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_38", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_38", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "averagepooling2d_4", "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed3", 0, 0]]], "config": {"dim_ordering": "tf", "border_mode": "same", "name": "averagepooling2d_4", "trainable": true, "strides": [1, 1], "pool_size": [3, 3]}}, {"name": "convolution2d_31", "class_name": "Convolution2D", "inbound_nodes": [[["mixed3", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_31", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 192, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_34", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_33", 0, 0]]], "config": {"nb_col": 1, "nb_row": 7, "bias": true, "name": "convolution2d_34", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 192, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_39", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_38", 0, 0]]], "config": {"nb_col": 7, "nb_row": 1, "bias": true, "name": "convolution2d_39", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 192, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_40", "class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_4", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_40", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 192, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_31", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_31", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_31", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_34", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_34", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_34", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_39", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_39", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_39", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_40", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_40", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_40", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "mixed4", "class_name": "Merge", "inbound_nodes": [[["batchnormalization_31", 0, 0], ["batchnormalization_34", 0, 0], ["batchnormalization_39", 0, 0], ["batchnormalization_40", 0, 0]]], "config": {"mode_type": "raw", "mode": "concat", "output_shape_type": "raw", "dot_axes": -1, "name": "mixed4", "concat_axis": 3, "output_shape": null}}, {"name": "convolution2d_45", "class_name": "Convolution2D", "inbound_nodes": [[["mixed4", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_45", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 160, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_45", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_45", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_45", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "convolution2d_46", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_45", 0, 0]]], "config": {"nb_col": 1, "nb_row": 7, "bias": true, "name": "convolution2d_46", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 160, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_46", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_46", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_46", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "convolution2d_42", "class_name": "Convolution2D", "inbound_nodes": [[["mixed4", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_42", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 160, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_47", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_46", 0, 0]]], "config": {"nb_col": 7, "nb_row": 1, "bias": true, "name": "convolution2d_47", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 160, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_42", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_42", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_42", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_47", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_47", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_47", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "convolution2d_43", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_42", 0, 0]]], "config": {"nb_col": 7, "nb_row": 1, "bias": true, "name": "convolution2d_43", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 160, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_48", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_47", 0, 0]]], "config": {"nb_col": 1, "nb_row": 7, "bias": true, "name": "convolution2d_48", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 160, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_43", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_43", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_43", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_48", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_48", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_48", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "averagepooling2d_5", "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed4", 0, 0]]], "config": {"dim_ordering": "tf", "border_mode": "same", "name": "averagepooling2d_5", "trainable": true, "strides": [1, 1], "pool_size": [3, 3]}}, {"name": "convolution2d_41", "class_name": "Convolution2D", "inbound_nodes": [[["mixed4", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_41", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 192, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_44", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_43", 0, 0]]], "config": {"nb_col": 1, "nb_row": 7, "bias": true, "name": "convolution2d_44", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 192, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_49", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_48", 0, 0]]], "config": {"nb_col": 7, "nb_row": 1, "bias": true, "name": "convolution2d_49", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 192, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_50", "class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_5", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_50", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 192, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_41", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_41", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_41", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_44", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_44", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_44", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_49", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_49", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_49", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_50", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_50", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_50", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "mixed5", "class_name": "Merge", "inbound_nodes": [[["batchnormalization_41", 0, 0], ["batchnormalization_44", 0, 0], ["batchnormalization_49", 0, 0], ["batchnormalization_50", 0, 0]]], "config": {"mode_type": "raw", "mode": "concat", "output_shape_type": "raw", "dot_axes": -1, "name": "mixed5", "concat_axis": 3, "output_shape": null}}, {"name": "convolution2d_55", "class_name": "Convolution2D", "inbound_nodes": [[["mixed5", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_55", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 160, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_55", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_55", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_55", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "convolution2d_56", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_55", 0, 0]]], "config": {"nb_col": 1, "nb_row": 7, "bias": true, "name": "convolution2d_56", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 160, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_56", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_56", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_56", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "convolution2d_52", "class_name": "Convolution2D", "inbound_nodes": [[["mixed5", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_52", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 160, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_57", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_56", 0, 0]]], "config": {"nb_col": 7, "nb_row": 1, "bias": true, "name": "convolution2d_57", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 160, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_52", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_52", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_52", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_57", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_57", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_57", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "convolution2d_53", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_52", 0, 0]]], "config": {"nb_col": 7, "nb_row": 1, "bias": true, "name": "convolution2d_53", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 160, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_58", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_57", 0, 0]]], "config": {"nb_col": 1, "nb_row": 7, "bias": true, "name": "convolution2d_58", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 160, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_53", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_53", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_53", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_58", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_58", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_58", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "averagepooling2d_6", "class_name": "AveragePooling2D", "inbound_nodes": [[["mixed5", 0, 0]]], "config": {"dim_ordering": "tf", "border_mode": "same", "name": "averagepooling2d_6", "trainable": true, "strides": [1, 1], "pool_size": [3, 3]}}, {"name": "convolution2d_51", "class_name": "Convolution2D", "inbound_nodes": [[["mixed5", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_51", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 192, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_54", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_53", 0, 0]]], "config": {"nb_col": 1, "nb_row": 7, "bias": true, "name": "convolution2d_54", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 192, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_59", "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_58", 0, 0]]], "config": {"nb_col": 7, "nb_row": 1, "bias": true, "name": "convolution2d_59", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 192, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "convolution2d_60", "class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_6", 0, 0]]], "config": {"nb_col": 1, "nb_row": 1, "bias": true, "name": "convolution2d_60", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 192, "dim_ordering": "tf", "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "activation": "relu", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"name": "batchnormalization_51", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_51", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_51", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_54", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_54", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_54", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_59", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_59", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_59", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "batchnormalization_60", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_60", 0, 0]]], "config": {"mode": 0, "epsilon": 1e-05, "name": "batchnormalization_60", "beta_regularizer": null, "trainable": true, "axis": 3, "gamma_regularizer": null, "momentum": 0.99}}, {"name": "mixed6", "class_name": "Merge", "inbound_nodes": [[["batchnormalization_51", 0,