{"keras_version": "1.1.0", "config": [{"config": {"init": "uniform", "dropout": 0.0, "input_dtype": "int32", "activity_regularizer": null, "input_dim": 20000, "name": "embedding_1", "output_dim": 64, "batch_input_shape": [null, 200], "mask_zero": false, "input_length": 200, "W_regularizer": null, "trainable": true, "W_constraint": null}, "class_name": "Embedding"}, {"config": {"name": "bidirectional_1", "trainable": true, "layer": {"config": {"stateful": false, "init": "glorot_uniform", "dropout_U": 0.0, "input_dim": 64, "unroll": false, "name": "forward_lstm_1", "go_backwards": false, "trainable": true, "activation": "tanh", "forget_bias_init": "one", "U_regularizer": null, "inner_init": "orthogonal", "b_regularizer": null, "input_length": null, "inner_activation": "hard_sigmoid", "W_regularizer": null, "return_sequences": false, "consume_less": "cpu", "output_dim": 32, "dropout_W": 0.0}, "class_name": "LSTM"}, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "name": "dense_1", "b_constraint": null, "activation": "sigmoid", "bias": true, "b_regularizer": null, "output_dim": 1, "W_regularizer": null, "trainable": true, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}